In [1]:
import numpy as np
import pandas as pd

In [2]:
data_dic={
    'A':[1,2,np.nan,4,np.nan],
    'B':[np.nan,np.nan,np.nan,np.nan,np.nan],
    'C':[11,12,13,14,15],
    'D':[16,np.nan,18,19,20]
}
df=pd.DataFrame(data_dic)
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      float64
 1   B       0 non-null      float64
 2   C       5 non-null      int64
 3   D       4 non-null      float64
dtypes: float64(3), int64(1)
memory usage: 292.0 bytes

In [4]:
df.isnull()

       A     B      C      D
0  False  True  False  False
1  False  True  False   True
2   True  True  False  False
3  False  True  False  False
4   True  True  False  False

In [5]:
df.isnull().sum()

A    2
B    5
C    0
D    1
dtype: int64

In [6]:
df.isnull().sum().sum()

8

In [7]:
df['A'].isnull()

0    False
1    False
2     True
3    False
4     True
Name: A, dtype: bool

In [8]:
df['A'].isnull().sum()

2

In [9]:
df.isna()

       A     B      C      D
0  False  True  False  False
1  False  True  False   True
2   True  True  False  False
3  False  True  False  False
4   True  True  False  False

In [10]:
df.isna().sum()

A    2
B    5
C    0
D    1
dtype: int64

In [11]:
df.isna().sum().sum()

8

In [20]:
df.loc[0].isnull().sum()

1

In [21]:
df.notnull()

       A      B     C      D
0   True  False  True   True
1   True  False  True  False
2  False  False  True   True
3   True  False  True   True
4  False  False  True   True

In [23]:
df.shape

(5, 4)

In [24]:
df.notnull().sum()

A    3
B    0
C    5
D    4
dtype: int64

In [25]:
df.notnull().sum().sum()

12

In [26]:
df['A'].sum()

7.0

In [27]:
df['A'].mean()

2.3333333333333335

In [28]:
df.loc[3].sum()

37.0

In [29]:
df.dropna(axis=0)

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [30]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [31]:
df.dropna(axis=1)

    C
0  11
1  12
2  13
3  14
4  15

In [32]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [33]:
df.dropna(thresh=4,axis=1)

    C     D
0  11  16.0
1  12   NaN
2  13  18.0
3  14  19.0
4  15  20.0

In [34]:
df.fillna(value=2)

     A    B   C     D
0  1.0  2.0  11  16.0
1  2.0  2.0  12   2.0
2  2.0  2.0  13  18.0
3  4.0  2.0  14  19.0
4  2.0  2.0  15  20.0

In [35]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [36]:
df['A'].fillna(value=df['A'].mean())

0    1.000000
1    2.000000
2    2.333333
3    4.000000
4    2.333333
Name: A, dtype: float64

In [37]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [38]:
df.fillna(method="ffill")

C:\Users\Asus\AppData\Local\Temp\ipykernel_9412\3944122520.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  16.0
2  2.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  4.0 NaN  15  20.0

In [39]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [40]:
df.fillna(method="bfill")

C:\Users\Asus\AppData\Local\Temp\ipykernel_9412\3896554658.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="bfill")

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  18.0
2  4.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [41]:
df.fillna(0)

     A    B   C     D
0  1.0  0.0  11  16.0
1  2.0  0.0  12   0.0
2  0.0  0.0  13  18.0
3  4.0  0.0  14  19.0
4  0.0  0.0  15  20.0

In [42]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [43]:
from sklearn.impute import SimpleImputer

In [44]:
df2=df.copy()

In [45]:
df2

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [46]:
data={
    'Store':['Walmart','Walmart','Costo','Costo','Target','Target'],
    'Customer':['Tim','Jermy','Mark','Jenice','Ray','Sam'],
    'Sales':[150,200,550,90,430,120]
}

In [47]:
df=pd.DataFrame(data)

In [48]:
df

     Store Customer  Sales
0  Walmart      Tim    150
1  Walmart    Jermy    200
2    Costo     Mark    550
3    Costo   Jenice     90
4   Target      Ray    430
5   Target      Sam    120

In [49]:
df.groupby('Store').sum("Sales")

         Sales
Store
Costo      640
Target     550
Walmart    350

In [52]:
df.groupby('Store')[['Sales']].sum()

         Sales
Store
Costo      640
Target     550
Walmart    350

In [54]:
df.groupby('Store')[['Sales']].mean()

         Sales
Store
Costo    320.0
Target   275.0
Walmart  175.0

In [55]:
df1=df.groupby("Store")

In [56]:
df1

In [57]:
df1.sum()

           Customer  Sales
Store
Costo    MarkJenice    640
Target       RaySam    550
Walmart    TimJermy    350

In [58]:
df.groupby('Store').sum()

           Customer  Sales
Store
Costo    MarkJenice    640
Target       RaySam    550
Walmart    TimJermy    350

In [61]:
df.groupby('Store')[["Sales"]].mean()

         Sales
Store
Costo    320.0
Target   275.0
Walmart  175.0

In [62]:
by_store=df.groupby("Store")

In [63]:
by_store.min()

        Customer  Sales
Store
Costo     Jenice     90
Target       Ray    120
Walmart    Jermy    150

In [64]:
by_store.max()

        Customer  Sales
Store
Costo       Mark    550
Target       Sam    430
Walmart      Tim    200

In [65]:
by_store[['Sales']].std()

              Sales
Store
Costo    325.269119
Target   219.203102
Walmart   35.355339

In [66]:
by_store.count()

         Customer  Sales
Store
Costo           2      2
Target          2      2
Walmart         2      2

In [68]:
df1=pd.DataFrame({
    'key':['a','b','c','d','e'],
     'A1':range(5),
      'B1':range(5,10)
}
    )

In [69]:
df1

  key  A1  B1
0   a   0   5
1   b   1   6
2   c   2   7
3   d   3   8
4   e   4   9

In [70]:
df2=pd.DataFrame({
    'key':['a','b','c'],
     'A2':range(3),
      'B2':range(3,6)
})

In [71]:
df2

  key  A2  B2
0   a   0   3
1   b   1   4
2   c   2   5

In [72]:
pd.merge(df1,df2,how='inner',on='key')

  key  A1  B1  A2  B2
0   a   0   5   0   3
1   b   1   6   1   4
2   c   2   7   2   5

In [73]:
pd.merge(df1,df2,how='inner',on='key')[['key','A1','A2']]

  key  A1  A2
0   a   0   0
1   b   1   1
2   c   2   2

In [74]:
type(np.nan)

float

In [75]:
pd.merge(df1,df2,how='left',on='key')

  key  A1  B1   A2   B2
0   a   0   5  0.0  3.0
1   b   1   6  1.0  4.0
2   c   2   7  2.0  5.0
3   d   3   8  NaN  NaN
4   e   4   9  NaN  NaN

In [76]:
pd.merge(df1,df2,how='right',on='key')

  key  A1  B1  A2  B2
0   a   0   5   0   3
1   b   1   6   1   4
2   c   2   7   2   5

In [78]:
pd.merge(df1,df2,how="outer",on='key')

  key  A1  B1   A2   B2
0   a   0   5  0.0  3.0
1   b   1   6  1.0  4.0
2   c   2   7  2.0  5.0
3   d   3   8  NaN  NaN
4   e   4   9  NaN  NaN

In [79]:
left=pd.DataFrame({
    'key1':['a','a','b','c'],
    'key2':['a','b','a','b'],
    'A':['A0','A1','A2','A3'],
    'B':['B0','B1','B2','B3']
})

In [80]:
left

  key1 key2   A   B
0    a    a  A0  B0
1    a    b  A1  B1
2    b    a  A2  B2
3    c    b  A3  B3

In [81]:
right=pd.DataFrame({
    'key1':['a','b','b','c'],
    'key2':['a','b','a','a'],
     'C':['C0','C1','C2','C3'],
     'D':['D0','D1','D2','D3']})

In [82]:
right

  key1 key2   C   D
0    a    a  C0  D0
1    b    b  C1  D1
2    b    a  C2  D2
3    c    a  C3  D3

In [83]:
pd.merge(left,right,how='inner',on=['key1','key2'])

  key1 key2   A   B   C   D
0    a    a  A0  B0  C0  D0
1    b    a  A2  B2  C2  D2

In [85]:
pd.merge(left,right,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0    a    a   A0   B0   C0   D0
1    a    b   A1   B1  NaN  NaN
2    b    a   A2   B2   C2   D2
3    b    b  NaN  NaN   C1   D1
4    c    a  NaN  NaN   C3   D3
5    c    b   A3   B3  NaN  NaN

In [87]:
suci1=pd.DataFrame(
    {
        'A':['A0','A1','A2','A3','A4'],
        'B':['B0','B1','B2','B3','B4'],
        'C':['C0','C1','C2','C3','C4'],
        'D':['D0','D1','D2','D3','D4']},
    index=[0,1,2,3,4]
        
)

In [88]:
suci1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4

In [89]:
suci2=pd.DataFrame({
    'A':['A5','A6','A7','A8'],
     'B':['B5','B6','B7','B8'],
     'C':['C5','C6','C7','C8'],
     'D':['D5','D6','D7','D8']
},
index=[5,6,7,8]
                  )

In [90]:
suci2

    A   B   C   D
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7
8  A8  B8  C8  D8

In [92]:
pd.concat([suci1,suci2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7
8  A8  B8  C8  D8